Agile/sprintlength.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Perhaps we need to change the length of the sprint?</title>
<!-- 2016-02-01 Mon 21:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Perhaps we need to change the length of the sprint?</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Background</a></li>
<li><a href="#sec-3">The problems</a></li>
<li><a href="#sec-4">The solution</a></li>
<li><a href="#sec-5">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
It's been a while since I've posted to my blog, so I thought I would
share our experience of adjusting our sprint length, which we have
just done for the current sprint.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Background</h2>
<div class="outline-text-2" id="text-2">
<p>
We are developing an application for authoring eLearning content. We
have two developers, myself and one other and a non dedicated
tester. Since I started at cm group we have been working at basing
our development on scrum, initally starting with a 1 week
sprint. This was successful while we were working on a prototype
(questions arise as to how agile we were being and why we had
sprints for prototypes, see my thoughts on prototyping
here). However when we moved away from the prototype we started
hitting problems.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">The problems</h2>
<div class="outline-text-2" id="text-3">
<p>
The problems can be summarised as follows:
</p>

<ol class="org-ol">
<li>The stories could only be split down so far as to be feasible
stories. As we have two developers, it usually meant that stories
were ready for testing only after a couple of days.
</li>
<li>Distractions (other essential work that 1 developer and the
tester has within their responsibilites) impacted the ability to
complete stories quickly.
</li>
<li>We tended to have all stories queued up for testing right until
the end of the week, putting a high load on the tester. One week
she was off ill on a Thursday, everything needed testing on
Friday and problems were found that could not be fixed and
retested by the end of the day. We ended up with a zero velocity
sprint&#x2026;.. for the second time.
</li>
</ol>

<p>
It was at point 3 we realised something was not quite right and in
true scrum fashion decided to 'inspect and adapt'.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">The solution</h2>
<div class="outline-text-2" id="text-4">
<p>
In order to solve this issue, we had to do the following:
</p>

<ol class="org-ol">
<li>Stories should be ready to test earlier in the sprint, this could
be done by reducing the scope of the stories, increasing the
resource or lengthening the sprint.
</li>
<li>The impact of a lack of resource for a day in a sprint needs to
be reduced either by having more resources or again by
lengthening the sprint so that time off is proportionally less in
respect to the sprint length.
</li>
<li>Reduce distractions from other work. This is difficult, due to
the nature of the business and the skill set of the team. Again,
an increase in resources would help this and again, a longer
sprint may reduce the impact of distractions by spreading them
over a longer period. Unfortunately, at the moment, the
distractions are something we have to live with. One of the
reasons we chose 1 week sprints intially was because we believed
we could push back on requests for other work to be completed to
the following sprint. Unfortunately this has not always been the
case.
</li>
</ol>

<p>
So our options were:
</p>

<ol class="org-ol">
<li>Increase resource - not possible in the short term, although
there is ongoing training for another tester to give us the
option of 2 possible testers.
</li>
<li>Decrease the size of the stories - as we have already decided,
this is not really feasible.
</li>
<li>Increase the sprint length - the simplest option.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Summary</h2>
<div class="outline-text-2" id="text-5">
<p>
So we have decided to go from 1 week to 2 week sprints as we have a
small team and story sizes that may warrant a longer sprint length,
given our environment.
</p>

<p>
However, there are some things that can and should be addressed,
which would help us with the problems outlined above:
</p>

<ol class="org-ol">
<li>Increase our automated UI testing to remove the need for so many
manual tests and effectively increase our tester resource.
</li>
<li>Educate the business on the impact of distractions and perhaps
the need to manage these a bit better than we are.
</li>
<li>Take a good look at why these distractions are occuring in the
first place, as some of them our bugs in our product that should
have been picked up by good unit testing, something that is
lacking in the legacy code we have.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-01 Mon 21:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
